[
    {
        "title": "Hello, World!",
        "date": "2024-10-24",
        "summary": "Why did I decide to start a blog, or this website in general?",
        "content": "<p>To put it simply, I didn't think I would be back to writing blog posts on my own custom website again.  I haven't done something like this in years.  However, I'm in a different phase of life, and quite frankly, this seems like the only best way I can get my thoughts out there.  To put it simply, life's gotten crazy for me.  In many good ways, don't worry, but it seems like less and less of my time is being available to me to work on stuff.  However, I do have a light at the end of the tunnel.  I'm in my last year of college, and my career going forward is looking very promising.  With that, comes more opportunities for me to do more things.  However, as I've spent more time away from everything, it's made me rethink how I've wanted my online prescence to be.  Do I want to stick to exclusively animation, do I want to focus on game dev, do I want to be a video essay creator, or do I just want to stop creating altogether and just exist?  So many routes, yet no clue how to proceed forward.  On top of that, my perspective on social media as a whole has wanned exponentially.  I've grown less and less interested in growing as a creator on social media every year with how much worse each platform has become and how more deplorable some creators have become as a resort of it.  I've known this for years now, but it's taken me forever to admit it.  I don't want to be a number chaser.  I don't want to limit my creativity and ability to what a fucking number says on a dashboard.  However, my problem still remains.  Social media seemed to be the only way I could share my work online...or is it?  Over the past few months, I've grown fascinated with the idea of personal websites.  Places where people made their own sort of landmark on the Internet.  Their own sort of place.  No social media standards or expectations, just their place.  It's a hallmark to an era of the Internet that has long passed, but to me maybe it should be my comeback.  Maybe it should be my return to the Internet.  Instead of just relying on social media to be my place, I can just build a place of my own for all my creativity and passion to be.  And that's what all this is for.  A singular place for everything of my own to be kept.  An archive, a memorium, a landmark, however you want to call it, this is my place.  This is really what I've been needing all along.  Just a place for me to organize everything I do and archive my history.  Because no matter what happens, I can keep my history here in one place, so everyone will know where to find me.  I'm not entirely sure of what I'll put here, but I've already got some stuff going, but at the end of the day, this is my place.  And it's not going anywhere!</p>"
    },
    {
        "title": "Echo Chambers",
        "date": "2024-10-24",
        "summary": "We've all gotten too used to not thinking, that we've forgotten how to think",
        "content": "<p>Dang, two blog posts in one day, that's kinda crazy XD, then again AI could probably churn out two of these in a minute, so whatever.  Not like it matters to me.  Anywho, what am I talking about again?  Oh yeah, echo chambers.  Pretty simply concept.  You watch a movie, you like it, then you watch a bunch of commentary YouTubers (not calling any names cause it's not worth my time), and suddenly your entire perception of the medium changes.  It's so fucking stupid to me.  I've even seen it happen to myself a couple times, and I always get so mindblown when I catch myself.  We've all just grown so used to social media mass producing content about everything we could ever think about, we've just forgotten the ability to think and come up with our own opinions on things, and quite frankly it bothers me for more reasons than just media literacy.  But, to keep it in the realm of media literacy, I've grown to realize over the years that art is always subjective, and there will always be people that like things that others hate and hate things that other people like.  Take for instance, there was this comedy movie made by Adam Sandler's production company called Masters of Disguise starring Dana Carvey most famously known for Saturday Night Live.  It's one of the lowest rated comedy movies of all time mainly for its weak and even racist humor, poor writing, and seemingly lack of charm that a lot of Sandler films were known for.  However, I know quite a few people who are close to me that absolutely adore the film and think it's one of the funniest movies out there.  Why?  I'm not entirely sure.  I was always confused by that.  How could someone like something so horrendously hated, that was until I saw Lightyear in the theaters.  I went there with a friend, and we both absolutely loved it.  The story was engaging and interesting, the environments were beautiful, there were plenty of homages to the original cartoon series from the early 2000s, it had it all.  However, I found out online that many actually hated the film.  In fact, they thought it was absolutely terrible.  The story didn't fit the tone they thought the movie would be, the plot twist was dumb, and it was overall just a boring movie.  I was a little shocked by this, and over time I watched more and more and I ended up believing it for a bit.  I starting to think Lightyear was actually bad.  Then I thought about it again, and more and more of these arguments didn't add up to me.  I still thought Lightyear was badass.  I still felt it was a movie worth watching.  I felt that these reviewers just were lame and didn't understand media.  However, as I took a step back and thought about it, I began to realize something.  Sure, media is subjective, but how subjective is it really if we're only taking opinions from others around us?  It almost felt like every time I watched a movie review, it was a carbon copy of the exact same points I saw from the last.  Over and over again, the same recycled and regurgitated arguments.  And it didn't apply to just media, but to controversy and drama, political nonsense, etc.  Overtime, I just grew distasteful of it all until I reached a breaking point.  At the end of it all, none of it really matters.  Sure, I could rant all day about why a certain movie is better or worse compared to X YouTuber's opinion, but at the end of the day we're arguing about entertainment.  Isn't entertainment meant to be just entertaining?  Isn't entertainment just something for us to enjoy at our own leisure whether it's stupid or not?  I guess with that argument, it doesn't really make sense to care that much about whether a movie is good or not does it?  I guess, all that really matters is whether we get to sit down at the end of the day and enjoy what we feel like enjoying.  It's pretty nice that we just have so much to enjoy entertainment wise in this world, and while yes there is a lot of junk, I feel like the best answer is instead of complaining and arguing with each other all the time, we just find and watch better entertainment.  We just enjoy what we want to enjoy, and if someone else complains about it, who cares.  You're having fun, so just enjoy it.  Enjoy the ride, cause at the end of the day, when you finish an 8 hour shift and you're trying to relax at the end of the day with your gf and watch a movie, you're not caring about how the viewers will think of your 4 hour video essay of this movie.  You just want to watch a movie.</p>"
    }
]